# tap all the normal stuff
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "git-duet/tap"

# terminal and text editor
cask "iterm2"
brew "nvim"

# things to install things
brew "asdf"
brew "wget"

# desktop environment ahoy hoy
cask "rectangle"
brew "tig"
cask "flycut"

# good tools to have on the command line
brew "direnv"
brew "fswatch"
brew "jq"
brew "pt" # new and improved ag
brew "tldr"
brew "tree"
brew "watch"
brew "z"
brew "entr"
brew "git-duet"

# Need a Postgres for most app dev work
brew "postgresql", restart_service: true
brew "postgresql@13"

